[{"url":"search/","title":"Search results","description":"","tags":[],"text":"window.init_search();SearchResults\nLoading..."},{"url":"sidebar data/","title":"sidebar data","description":"","tags":[],"text":"sections \"FITS files\", \"units\", \"cosmology\" Dict \"main\" uppercase section collections section .pages for section in sections , "},{"url":"tutorials/cosmo-plots/","title":"Plotting cosmological redshift and age","description":"Work with units in astrophysical calculations.","tags":["cosmology","physics","units","plots"],"text":" A Pluto.jl notebook v0.20.21 frontmatter title \"Plotting cosmological redshift and age\" layout \"layout.jlhtml\" date \"2025 11 21\" description \"Work with units in astrophysical calculations.\" tags \"cosmology\", \"physics\", \"units\", \"plots\" frontmatter.author name \"Ian Weaver\" url \"https github.com icweaver\" using Markdown using InteractiveUtils using Cosmology, CairoMakie, DynamicQuantities cosmo cosmology h 70, OmegaM 0.3 md\"\"\" todo Add DQ unit support \"\"\" zvals 0 0.1 6 dist c, zs angular diameter dist c, z for z in zs md\"\"\" todo Factor out unitful return values? \"\"\" d dist cosmo, zvals lines zvals, d ages map zvals do z a age cosmo, z .val . 100 round a digits 2 end md\"\"\" todo Is this factor of 100 needed? Can the discrepancy be explained by the defn of `angular diameter dist`? \"\"\" cosmo planck cosmology h 67.77, OmegaM 0.30712 d planck dist cosmo planck, zvals let fig, ax1, p lines zvals, d planck label \"Planck 2013\" lines ax1, zvals, d label \"h 0.7, ...\" n 15 ax2 Axis fig 1, 1 xaxisposition top, xticks zvals begin n end , xtickformat x string. ages begin n end Labels ax1.xlabel \"Redshift\" ax1.ylabel \"Angular diameter distance\" ax2.xlabel \"Time since Big Bang Gyr \" Grid lines ticks ax1.xminorticksvisible true ax1.xgridvisible false ax2.xgridvisible false hideydecorations ax2 linkxaxes ax1, ax2 axislegend ax1 fig end "},{"url":"tutorials/fits-images/","title":"Working with FITS images","description":"View and manipulate data from FITS images.","tags":["FITS files","file I/O","images","image processing","plots","histograms","colorbars"],"text":" A Pluto.jl notebook v0.20.21 frontmatter title \"Working with FITS images\" layout \"layout.jlhtml\" date \"2025 11 19\" description \"View and manipulate data from FITS images.\" tags \"FITS files\", \"file I O\", \"images\", \"image processing\", \"plots\", \"histograms\", \"colorbars\" order 2 frontmatter.author name \"Ian Weaver\" url \"https github.com icweaver\" using Markdown using InteractiveUtils This Pluto notebook uses bind for interactivity. When running this notebook outside of Pluto, the following 'mock version' of bind gives bound variables a default value instead of an error . macro bind def, element format off return quote local iv try Base.loaded modules Base.PkgId Base.UUID \"6e696c72 6542 2067 7265 42206c756150\" , \"AbstractPlutoDingetjes\" .Bonds.initial value catch b missing end local el esc element global esc def Core.applicable Base.get, el ? Base.get el iv el el end format on end begin Data handling using DataFramesMeta DataFrame, rsubset using Downloads download using FITSFiles fits, info using Printf sprintf AstroImages example using StatsBase Histogram, fit, mean, median, std using AstroImages Percent, Near, X, Y, load, imview Makie example using CairoMakie Colorbar, IntervalsBetween, plot, stephist Makie AlgebraOfGraphics example using AlgebraOfGraphics data, mapping, histogram, visual, draw, scales end using PlutoUI TableOfContents, Slider, bindname md\"\"\" Working with FITS images Authors Ian Weaver This notebook is modified from https learn.astropy.org tutorials FITS images.html Companion to Working with FITS tables tutorials fits tables tip \"\" Learning Goals Customize a 2D histogram with image data Stack several images into a single image Todo Write image data to a FITS file Todo note \"\" Keywords FITS files, file I O, images, image processing, plots, histograms, colorbars warning \"\" Summary Following up from Working with FITS tables tutorials fits tables , this tutorial first demonstrates how to use AstroImages.jl https juliaastro.org AstroImages to preview images formed from FITS data tables before using Makie.jl https makie.org AlgebraOfGraphics.jl https aog.makie.org to make publication ready plots. Next, we will demonstrate how to these tools to help visualize simple image stacking from FITS images and save it back to file. \"\"\" md\"\"\" Imports \"\"\" md\"\"\" Images from FITS tables \"\"\" md\"\"\" Load data We start by loading in the data from the previous tutorial. For brevity, we combine the downloading, FITS file loading, and subsetting, into a single cell \"\"\" df evt main let event filename download \"http data.astropy.org tutorials FITS tables chandra events.fits\" df evt fits event filename 2 .data | DataFrame rsubset df evt ccd id ∈ 0 3 end md\"\"\" note We use the mutating version of ` rsubset` note the exclamation mark above because we do not need to preserve the original `DataFrame`, `df evt`, in this case. For more on mutating functions, see this section https docs.julialang.org en v1 manual variables man assignment expressions of the Julia manual. We next look at a few different ways that we can visualize the 2D histogram that we roughly previewed in the previous tutorial from explicit less convenient to implicit more convenient . \"\"\" md\"\"\" View with AstroImages.jl AstroImages.jl https juliaastro.org AstroImages is the main starting point in the JuliaAstro ecosystem for easily loading and viewing FITS image files. AstroImages.jl can also handle FITS tables, but it is currently limited in what types of tables it can support ^1 . For this tutorial, just using its `imview` function will be enough to give us a good starting point. note \"\" ^1 This package currently uses FITSIO.jl https juliaastro.org FITSIO , a convenience wrapper around a second wrapper, CFITSIO.jl http juliaastro.org CFITSIO , which wraps the CFITSIO C library https heasarc.gsfc.nasa.gov docs software fitsio fitsio.html for FITS file I O. Currently, FITSIO.jl cannot handle opening tables containing BitArray data. On the horizon, AstroImages.jl will use FITSFiles.jl https barrettp.github.io FITSFiles.jl dev as its backend, the pure Julia alternative currently being developed by JuliaAstro, which can handle this type of data. This is why we used it directly in the previous tutorial. Stay tuned for more \"\"\" md\"\"\" We start by using `StatsBase.fit` and `StatsBase.Histogram` to bin the ``x`` and ``y`` data ourselves before passing it to `imview` to view the image directly in the notebook. Later we will see how to do this binning step automatically for us \"\"\" h fit Histogram, df evt main.x, df evt main.y nbins 400 md\"\"\" The weights are returned as an `AbstractArray`, which can be viewed directly with AstroImages.jl \"\"\" imview h.weights clims Percent 99.5 , stretch identity, cmap cividis, contrast 1.0, bias 0.5, md\"\"\" We can immediately see structure appear in our image, and the outlines of the four main ACIS I chips. Try adjusting the imaging options commented out above to modify the image. See the `imview` documentation in the Live docs of this notebook for all available options. tip Try passing your own AbstractArray to `imview`. This function converts an array of numbers to an array of `ColorTypes` i.e., RGB values for visualizing our arrays in full color. For mor on this, see the Arrays, Numbers, and Colors https juliaimages.org latest tutorials arrays colors page arrays colors section of the JuliaImages documentation. \"\"\" Your code here, e.g., imview rand 3, 4 md\"\"\" Next we will see how to plot this image with labeled axes and a properly formatted colorbar. \"\"\" md\"\"\" Plotting with Makie.jl Makie.jl is a modern plotting ecosystem written in pure Julia. Its set of backends https docs.makie.org stable explanations backends backends What is a backend allows us to produce plots for a wide range of contexts. For this tutorial, we will use the CairoMakie.jl backend to produce publication quality vector graphic plots. To start, we will pass the histogram object `h` directly to Makie, which its `plot` command knows how to handle \"\"\" let fig, ax, p plot h colorrange 1, 10 000 , colorscale log10, colormap cividis, Colorbar fig 1, 2 , p ticks 1, 3, 6, 500, 10 000 , minorticksvisible true, minorticks IntervalsBetween 9 , fig end md\"\"\" tip Try adjusting the plot options above, or try adding your own See the Getting started https docs.makie.org stable tutorials getting started section of the Makie.jl documentation for a comprehensive tutorial. You may notice that there are still a few things missing from our plot that would be nice to have by defauly, e.g., labeled axes and a formatted colorbar. We will show an ergonomic way to do this next. \"\"\" md\"\"\" Plotting with Makie.jl AoG.jl Similarly to seaborn for Python, or ggplot2 in R, Julia provides AlgebraOfGraphics.jl, a plotting framework that extends existing plotting capabilities for a wide range of statistical and visualization applications of structured data. As with these other packages, its usecases are probably best shown by example \"\"\" let plt data df evt main mapping x, y histogram bins 400 visual colorscale log10 draw plt, scales Color colorrange 1, 10 000 , colormap cividis colorbar scale log10, ticks 1, 3, 6, 500, 10 000 , minorticksvisible true, minorticks IntervalsBetween 9 , end md\"\"\" Here, we reproduce the previous plot above, but now with the desired axes labeling and colorbar formatting applied for us. The colorbar is also automatically labeled for us and the shape of its endpoints are adjusted to triangles to show that the data values extend beyond what is shown on the colorbar scale. Additionally, note that we are working directly with the DataFrame object `df evt main` now instead of needing to manually fit a histogram beforehand. todo Check if there is a way to not have to specifiy `log10` in two places. tip See this very nice tutorial series https aog.makie.org stable tutorials intro i in the AlgebraOfGraphics.jl documentation for more. We now turn to working directly with FITS image data. \"\"\" md\"\"\" Images from FITS arrays For the rest of this tutorial, we will work with an astronomical image of the Horsehead Nebula taken with a photographic plate. The image has been digitized, i.e., scanned by a computer and converted to a 2D array. Each position in the array corresponds with the projected position on the sky, and bright areas of the image have high values while dark areas have low values in the array. Images taken with astronomical instruments called CCDs or \" charge coupled devices https en.wikipedia.org wiki Charge coupled device \" are organized similarly. When illuminated by light, CCDs accumulate electrons, converting brightness values to electron counts. A CCD image is essentially a 2D array, where each position on the array represents a single CCD pixel, and the values in that array represent the number of counts registered in that pixel. \"\"\" md\"\"\" Load data We start by downloading our data of the Horsehead Nebula from the link below \"\"\" hdus fits ∘ download \"http data.astropy.org tutorials FITS images HorseHead.fits\" md\"\"\" tip We use the `∘` operator https docs.julialang.org en v1 manual functions Function composition and piping typed `\\circ TAB ` to ergonomically compose functions together. This is equivalent to `fits download url `, just with fewer nested parentheses. \"\"\" md\"\"\" Taking a look, we see that we have the following HDUs \"\"\" info hdus md\"\"\" Generally, images are stored in the `PRIMARY` block. Let's take a look at it \"\"\" img data hdus 1 .data md\"\"\" We see that our image is an size img data, 1 × size img data, 2 array of 16 bit integers. This can be visualized in the same way as our heatmap examples above \"\"\" md\"\"\" Visualize Since this is just plain array data instead of tabular `DataFrame` data, we will use Makie.jl without the AlgebraOfGraphics.jl framework \"\"\" plot img data colormap magma md\"\"\" Alternatively, we can load the fits array and visualize it directly with AstroImages.jl \"\"\" img load \"http data.astropy.org tutorials FITS images HorseHead.fits\" md\"\"\" This does a few things for us out of the box Loads the FITS file directly from the url Selects the image HDU Converts the image array of numbers to a ColorTypes array i.e., automatically applies `imview` Stores the result as an `AstroImage` `AstroImage` objects behave much like regular arrays, which allows them to support the usual array indexing and `imview` options \"\"\" imview img 1 10, 1 10 imview img cmap Greys md\"\"\" And because the underlying data is just an array of numbers, we can perform the usual statistical measurements \"\"\" extrema img or minimum img , maximum img mean img median img std img let fig, ax, p stephist vec img data bins 50 ax.xlabel \"Pixel value\" ax.ylabel \"Counts\" fig end md\"\"\" and access the raw underlying data anytime \"\"\" img.data md\"\"\" Lastly, `AstroImage` objects use the DimensionalData.jl https rafaqz.github.io DimensionalData.jl interface, which allows them to participate in extended plotting and array handling functionality \"\"\" plot img colormap greys Makie knows how to handle this automatically md\"\"\" Here is another example where we add some additional customizations \"\"\" let fig, ax, p plot img colorscale log10, log scale the colors colormap greys, colorbar ticks 4e3, 5e3, 6e4, 1e4, 2e4 , minorticksvisible true, minorticks IntervalsBetween 9 , fig end img X 500, Y Near 500.1 img 500, 500 md\"\"\" For more on working with AstroImage data, see the Getting started https juliaastro.org AstroImages stable manual getting started section of the AstroImages.jl manual. We end by looking at a brief image stacking example. \"\"\" md\"\"\" Image stacking For this example, we'll stack several images of M13 taken with a ~10\" telescope. \"\"\" md\"\"\" Load data Let's start by opening a series of FITS files and storing the data in a vector called `imgs` \"\"\" We use the sprintf macro from the base Printf.jl Julia module to format our strings fpaths map 1 5 do i sprintf \"http data.astropy.org tutorials FITS images M13 blue %04d.fits\", i end md\"\"\" tip This is just an alternative syntax to array comprehensions. We could have just as easily done ```julia sprintf \"http data.astropy.org tutorials FITS images M13 blue %04d.fits\", i for i in 1 5 ``` See this section of the Julia manual https docs.julialang.org en v1 manual functions Do Block Syntax for Function Arguments for more on do block syntax. \"\"\" imgs load fpath for fpath in fpaths md\"\"\" Visualize \"\"\" md\"\"\" We can then directly sum up this vector of image data to produce a stacked image \"\"\" img stacked sum imgs md\"\"\" As in the examples above, this does the usual image transformations defined in `imview` to produce a nice image by default. We can also directly control this in the same way \"\"\" stephist vec img stacked bins 50 md\"\"\" The pixel values looks to be mostly around 2000, 3000 counts, so we set our colorbar limits there \"\"\" plot img stacked colorrange 2e3, 3e3 , colormap magma md\"\"\" Save Finally, we can save our underlying stacked image header data using the `save` function exported from AstroImages.jl ```julia using AstroImages save \"test.fits\", img stacked ``` \"\"\" md\"\"\" Notebook setup 🔧 \"\"\" TableOfContents "},{"url":"tutorials/fits-tables/","title":"Working with FITS tables","description":"View and manipulate data from FITS tables.","tags":["FITS files","file I/O","tables","plots","histograms"],"text":" A Pluto.jl notebook v0.20.21 frontmatter title \"Working with FITS tables\" layout \"layout.jlhtml\" date \"2025 11 18\" description \"View and manipulate data from FITS tables.\" tags \"FITS files\", \"file I O\", \"tables\", \"plots\", \"histograms\" order 1 frontmatter.author name \"Ian Weaver\" url \"https github.com icweaver\" using Markdown using InteractiveUtils This Pluto notebook uses bind for interactivity. When running this notebook outside of Pluto, the following 'mock version' of bind gives bound variables a default value instead of an error . macro bind def, element format off return quote local iv try Base.loaded modules Base.PkgId Base.UUID \"6e696c72 6542 2067 7265 42206c756150\" , \"AbstractPlutoDingetjes\" .Bonds.initial value catch b missing end local el esc element global esc def Core.applicable Base.get, el ? Base.get el iv el el end format on end begin using Downloads download using FITSFiles fits, info using DataFramesMeta DataFrame, rsubset using PlutoPlotly plot end using PlutoUI TableOfContents, Slider, bindname md\"\"\" Working with FITS tables Authors Ian Weaver This notebook is modified from https learn.astropy.org tutorials FITS tables.html tip \"\" Learning Goals Download a FITS table file from a URL Open a FITS table file and view table contents Make a 2D histogram with the table data note \"\" Keywords FITS files, file I O, tables, plots, histograms warning \"\" Summary This tutorial demonstrates the use of Downloads.jl https github.com JuliaLang Downloads.jl from base Julia to download a data file, then uses FITSFiles.jl https barrettp.github.io FITSFiles.jl dev to open the file and DataFramesMeta.jl https juliadata.org DataFramesMeta.jl stable to work with the tabular data. Lastly, we use PlutoPlotly.jl https github.com JuliaPluto PlutoPlotly.jl to visualize the data as 1D and 2D histograms. \"\"\" md\"\"\" Imports \"\"\" md\"\"\" Download a FITS table file Below, we download a FITS file from a Chandra observation of the Galactic Center using the `Downloads.download` function from base Julia to a temporary location \"\"\" event filename download \"http data.astropy.org tutorials FITS tables chandra events.fits\" md\"\"\" The file contains a list of events with ``x`` and ``y`` coordinates, energy, and various other pieces of information. \"\"\" md\"\"\" Visualize a FITS table file We next open this file and view its header information so called Header Data Units https www.stsci.edu hst wfpc2 Wfpc2 dhb intro ch23.html HDUs with the `FITSFiles.fits` and `FITSFiles.info` functions, respectively \"\"\" hdu list fits event filename info hdu list \"\"\" note For convenience, FITS files opened from a local directory, e.g., ` event filename `, are automatically closed for us. todo Include HDUNAME and or EXTNAME column s in displayed `info`? \"\"\" | Markdown.parse md\"\"\" In this case, we're interested in reading `EVENTS`, which contains information about each X ray photon that hit the detector. To find out what information the table contains, let's print the column names \"\"\" hdu list 2 .data | keys md\"\"\" todo Define a function for this? e.g., ```julia function FITSFiles.names hdu FITSFiles.HDU FITSFiles.Bintable parse hdu.cards for TTYPEN, TFORMN, TUNITN, etc. return name \"\", format \"\", ... , col1 name \"\", format \"\", unit \"\" col2 ... name \"\", format \"\", coord type \"\" colN end ``` Analogous to hdu.columns in astropy ``` ColDefs name 'time' format '1D' unit 's' name 'ccd id' format '1I' name 'node id' format '1I' name 'expno' format '1J' ... ``` \"\"\" md\"\"\" Now we'll take this data and convert it into a `DataFrame` table from the DataFrames.jl https dataframes.juliadata.org package, which is re exported from the DataFramesMeta.jl https juliadata.org DataFramesMeta.jl package for convenience \"\"\" df evt DataFrame hdu list 2 .data md\"\"\" note For people coming from other languages, this comparison page https dataframes.juliadata.org stable man comparisons Comparisons in the DataFrames.jl documentation may be helpful. While it's possible to access FITS tables directly from the `.data` attribute, wrapping it in a `DataFrame` tends to make a variety of common tasks more convenient for example, subsetting and directly plotting data, as we will show next. \"\"\" md\"\"\" 1D histogram We can extract data from the table by referencing the column name. Let's try making a histogram for the energy of each photon, which will give us a sense for the spectrum folded with the detector's efficiency \"\"\" plot df evt x energy, kind histogram, nbinsx md\"\"\" Move the slider below to update the number of bins used for the histogram \"\"\" bindname nbinsx Slider 15 100 default 80, show value true md\"\"\" tip We are using the small PlutoPlotly.jl https github.com JuliaPluto PlutoPlotly.jl package for easy interactivity in this notebook format. For publication quality plots with a wide range of analysis and customizations, see the modern Makie.jl https makie.org plotting package, which powers the AlgebraOfGraphics.jl https aog.makie.org stable framework for visualizing structured data. We will show examples of its use in our Working with FITS images tutorials fits images tutorial. \"\"\" md\"\"\" 2D histogram We can form an image from our fits table by binning the ``x`` and ``y`` coordinates of the events data into a 2D histogram. This particular observation spans five CCD chips. First, we determine the events that only fell on the main ACIS I chips, which have number ids 0, 1, 2, and 3 \"\"\" df evt main rsubset df evt ccd id ∈ 0 3 md\"\"\" note We use the ` rsubset` convenience macro exported from DataFramesMeta.jl to select the desired rows from our table, in this case the rows where the `ccd id` are equal to either 0, 1, 2, or 3. For more on working with `DataFrames` and using other convenience macros, see the DataFrames.jl https dataframes.juliadata.org and DataFramesMeta.jl https juliadata.org DataFramesMeta.jl documentation. In particular, people coming from other languages may find this short comparison table https juliadata.org DataFramesMeta.jl stable Comparison with dplyr and LINQ of convenience macros in the DataFramesMeta.jl documentation helpful. \"\"\" plot df evt x x, y y, kind histogram2d, nbinsx 100, nbinsy 100 md\"\"\" For more control over producing high quality plots, see our Working with FITS images tutorials fits images tutorial. \"\"\" md\"\"\" Notebook setup 🔧 \"\"\" TableOfContents "},{"url":"tutorials/","title":"index","description":"","tags":["Welcome"],"text":"learn.JuliaAstro Tutorials⚠️ This site is still under construction. Expect to see many changes! ⚠️Select one of the tutorials in the sidebar to get started"},{"url":"tutorials/units-DQ/","title":"Using units in astrophysical calculations","description":"Work with units in astrophysical calculations.","tags":["units","plots"],"text":" A Pluto.jl notebook v0.20.21 frontmatter title \"Using units in astrophysical calculations\" layout \"layout.jlhtml\" date \"2025 11 19\" description \"Work with units in astrophysical calculations.\" tags \"units\", \"plots\" frontmatter.author name \"Ian Weaver\" url \"https github.com icweaver\" using Markdown using InteractiveUtils This Pluto notebook uses bind for interactivity. When running this notebook outside of Pluto, the following 'mock version' of bind gives bound variables a default value instead of an error . macro bind def, element format off return quote local iv try Base.loaded modules Base.PkgId Base.UUID \"6e696c72 6542 2067 7265 42206c756150\" , \"AbstractPlutoDingetjes\" .Bonds.initial value catch b missing end local el esc element global esc def Core.applicable Base.get, el ? Base.get el iv el el end format on end using DynamicQuantities using DynamicQuantities.Constants pc, G using Distributions using CairoMakie using Unitful Unitful as U using PlutoUI TableOfContents, Slider, bindname md\"\"\" Using units in astrophysical calculations Authors Ian Weaver This notebook is modified from https learn.astropy.org tutorials quantities.html tip \"\" Learning Goals note \"\" Keywords units, plots warning \"\" Summary \"\"\" md\"\"\" Imports \"\"\" md\"\"\" Start \"\"\" Reff 29 u\"Constants.pc\" 29 pc values Reff dimension Reff Reff | us\"km\" md\"\"\" Synth. dataset of rad vels \"\"\" v rand Normal 206, 4.3 , 500 u\"km s\" first v, 10 .| us\"km s\" hist ustrip us\"km s\", v md\"\"\" todo See if units histograms will work ootb with https github.com MakieOrg Makie.jl pull 5323 \"\"\" sigma sqrt∘sum v . mean v .^2 length v sigma | us\"km s\" M 4 sigma^2 Reff G M .| us\"Constants.M sun\", us\"g\" log10 ∘ ustrip us\"Constants.M sun\", M log10 M Should error md\"\"\" Notebook setup 🔧 \"\"\" TableOfContents "}]